In [88]:
import pandas as pd

### importing data

In [89]:
df =pd.read_csv("Data/country_total.csv")

### Inspecting the DataFrame

In [90]:
df.head()

  country seasonality    month  unemployment  unemployment_rate
0      at         nsa  1993.01        171000                4.5
1      at         nsa  1993.02        175000                4.6
2      at         nsa  1993.03        166000                4.4
3      at         nsa  1993.04        157000                4.1
4      at         nsa  1993.05        147000                3.9

In [91]:
df.tail()

      country seasonality    month  unemployment  unemployment_rate
20791      uk       trend  2010.06       2429000                7.7
20792      uk       trend  2010.07       2422000                7.7
20793      uk       trend  2010.08       2429000                7.7
20794      uk       trend  2010.09       2447000                7.8
20795      uk       trend  2010.10       2455000                7.8

In [92]:
df.tail(3)

      country seasonality    month  unemployment  unemployment_rate
20793      uk       trend  2010.08       2429000                7.7
20794      uk       trend  2010.09       2447000                7.8
20795      uk       trend  2010.10       2455000                7.8

In [93]:
df.sample(10)

      country seasonality    month  unemployment  unemployment_rate
6323       fi          sa  1991.09        199000                7.9
12017      lu          sa  1991.06          3000                1.6
12322      lu       trend  1988.11          3000                1.8
18030      se          sa  2005.07        378000                8.1
13840      nl         nsa  2001.02        226000                2.8
19375      sk          sa  2009.08        342000               12.7
11882      lu         nsa  2008.03         10000                4.6
17862      se          sa  1991.07        145000                3.2
13183      mt         nsa  2006.05         11000                6.8
14429      nl       trend  1994.03        423000                5.9

In [94]:
print(df)

      country seasonality    month  unemployment  unemployment_rate
0          at         nsa  1993.01        171000                4.5
1          at         nsa  1993.02        175000                4.6
2          at         nsa  1993.03        166000                4.4
3          at         nsa  1993.04        157000                4.1
4          at         nsa  1993.05        147000                3.9
...       ...         ...      ...           ...                ...
20791      uk       trend  2010.06       2429000                7.7
20792      uk       trend  2010.07       2422000                7.7
20793      uk       trend  2010.08       2429000                7.7
20794      uk       trend  2010.09       2447000                7.8
20795      uk       trend  2010.10       2455000                7.8

[20796 rows x 5 columns]

In [95]:
df.shape

(20796, 5)

In [96]:
df.describe()

              month  unemployment  unemployment_rate
count  20796.000000  2.079600e+04       19851.000000
mean    1999.401290  7.900818e+05           8.179764
std        7.483751  1.015280e+06           3.922533
min     1983.010000  2.000000e+03           1.100000
25%     1994.090000  1.400000e+05           5.200000
50%     2001.010000  3.100000e+05           7.600000
75%     2006.010000  1.262250e+06          10.000000
max     2010.120000  4.773000e+06          20.900000

In [97]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20796 entries, 0 to 20795
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   country            20796 non-null  object
 1   seasonality        20796 non-null  object
 2   month              20796 non-null  float64
 3   unemployment       20796 non-null  int64
 4   unemployment_rate  19851 non-null  float64
dtypes: float64(2), int64(1), object(2)
memory usage: 812.5+ KB

In [123]:
df.values #2-dimensional numpy array

array([['at', 'nsa', 1993.01, 171000, 4.5],
       ['at', 'nsa', 1993.02, 175000, 4.6],
       ['at', 'nsa', 1993.03, 166000, 4.4],
       ...,
       ['uk', 'trend', 2010.08, 2429000, 7.7],
       ['uk', 'trend', 2010.09, 2447000, 7.8],
       ['uk', 'trend', 2010.1, 2455000, 7.8]], dtype=object)

In [124]:
df.columns

Index(['country', 'seasonality', 'month', 'unemployment', 'unemployment_rate'], dtype='object')

In [126]:
df.index

RangeIndex(start=0, stop=20796, step=1)

### fetching data

####  rows

In [98]:
df.iloc[0]

country                   at
seasonality              nsa
month                1993.01
unemployment          171000
unemployment_rate        4.5
Name: 0, dtype: object

In [99]:
type(df.iloc[0])

pandas.core.series.Series

In [100]:
df.iloc[0:7]

  country seasonality    month  unemployment  unemployment_rate
0      at         nsa  1993.01        171000                4.5
1      at         nsa  1993.02        175000                4.6
2      at         nsa  1993.03        166000                4.4
3      at         nsa  1993.04        157000                4.1
4      at         nsa  1993.05        147000                3.9
5      at         nsa  1993.06        134000                3.5
6      at         nsa  1993.07        128000                3.4

In [101]:
type(df.iloc[0:7])

pandas.core.frame.DataFrame

In [102]:
df.iloc[[3,47,459,2851]] #random rows

     country seasonality    month  unemployment  unemployment_rate
3         at         nsa  1993.04        157000                4.1
47        at         nsa  1996.12        173000                4.6
459       at       trend  1995.04        143000                3.8
2851      cz          sa  2003.08        407000                8.0

####  columns

In [103]:
df['month'] # single column

0        1993.01
1        1993.02
2        1993.03
3        1993.04
4        1993.05
          ...
20791    2010.06
20792    2010.07
20793    2010.08
20794    2010.09
20795    2010.10
Name: month, Length: 20796, dtype: float64

In [104]:
df[['country','unemployment']]

      country  unemployment
0          at        171000
1          at        175000
2          at        166000
3          at        157000
4          at        147000
...       ...           ...
20791      uk       2429000
20792      uk       2422000
20793      uk       2429000
20794      uk       2447000
20795      uk       2455000

[20796 rows x 2 columns]

In [105]:
df.iloc[:,[0,4]] #using iloc to display column

      country  unemployment_rate
0          at                4.5
1          at                4.6
2          at                4.4
3          at                4.1
4          at                3.9
...       ...                ...
20791      uk                7.7
20792      uk                7.7
20793      uk                7.7
20794      uk                7.8
20795      uk                7.8

[20796 rows x 2 columns]

In [106]:
df['unemployment_rate'].value_counts()

7.2     305
7.1     290
7.4     285
7.3     271
7.8     255
       ...
1.3       4
20.5      3
20.7      2
1.1       2
20.9      1
Name: unemployment_rate, Length: 197, dtype: int64

In [107]:
df['unemployment_rate'].value_counts().sort_values(ascending=True)

20.9      1
1.1       2
20.7      2
20.5      3
1.3       4
       ...
7.8     255
7.3     271
7.4     285
7.1     290
7.2     305
Name: unemployment_rate, Length: 197, dtype: int64

In [108]:
df['country'].value_counts()

fr    1008
se    1008
pt    1008
nl    1008
lu    1008
dk    1008
be    1008
es    1008
ie    1008
uk    1002
it     924
fi     828
no     786
at     648
hu     576
sk     576
si     576
bg     576
mt     576
pl     576
de     504
cz     468
lv     459
lt     459
gr     450
ro     423
cy     396
ee     387
hr     324
tr     210
Name: country, dtype: int64

In [109]:
mask1=df["seasonality"]=="nsa"

In [110]:
mask2 = df["country"] =="ro"

In [111]:
mask3=df["unemployment_rate"] >5.0

In [112]:
mask3.sample(5)

9733     False
20344    False
526      False
4264      True
19605     True
Name: unemployment_rate, dtype: bool

In [113]:
df[mask3]

      country seasonality    month  unemployment  unemployment_rate
36         at         nsa  1996.01        193000                5.1
37         at         nsa  1996.02        202000                5.3
38         at         nsa  1996.03        193000                5.1
49         at         nsa  1997.02        196000                5.2
60         at         nsa  1998.01        205000                5.4
...       ...         ...      ...           ...                ...
20791      uk       trend  2010.06       2429000                7.7
20792      uk       trend  2010.07       2422000                7.7
20793      uk       trend  2010.08       2429000                7.7
20794      uk       trend  2010.09       2447000                7.8
20795      uk       trend  2010.10       2455000                7.8

[15221 rows x 5 columns]

In [114]:
mask1

0         True
1         True
2         True
3         True
4         True
         ...
20791    False
20792    False
20793    False
20794    False
20795    False
Name: seasonality, Length: 20796, dtype: bool

In [115]:
ro_data =df[mask1 & mask2 & mask3]

In [116]:
ro_data.shape

(141, 5)

In [117]:
ro_data.describe()

             month  unemployment  unemployment_rate
count   141.000000  1.410000e+02         141.000000
mean   2004.447021  7.330638e+05           7.136170
std       3.403746  9.935120e+04           0.972205
min    1999.010000  5.510000e+05           5.400000
25%    2001.120000  6.660000e+05           6.400000
50%    2004.110000  7.200000e+05           7.000000
75%    2007.100000  8.010000e+05           7.800000
max    2010.090000  1.029000e+06          10.300000

In [118]:
ro_data.sample(12)

      country seasonality    month  unemployment  unemployment_rate
17075      ro         nsa  2005.03        832000                8.5
17030      ro         nsa  2001.06        758000                6.7
17086      ro         nsa  2006.02        762000                7.8
17091      ro         nsa  2006.07        730000                7.0
17130      ro         nsa  2009.10        731000                7.5
17120      ro         nsa  2008.12        568000                5.8
17139      ro         nsa  2010.07        703000                6.9
17037      ro         nsa  2002.01       1029000               10.3
17013      ro         nsa  2000.01        927000                8.6
17043      ro         nsa  2002.07        816000                7.7
17042      ro         nsa  2002.06        862000                8.3
17085      ro         nsa  2006.01        762000                7.8